УТ_для_edt/src/InformationRegisters/CRM_ПрогнозыВероятностиСделки/CRM_ПрогнозыВероятностиСделки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ПрогнозыВероятностиСделки</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Вероятность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сделка</name>
    <type>
      <types>DocumentRef.CRM_Интерес</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/CRM_ПрогнозыВероятностиСделки/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьВероятность(Сделка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеВероятности = Новый Структура;
	ДанныеВероятности.Вставить("Вероятность", Неопределено);
	ДанныеВероятности.Вставить("Дата", '00010101');
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПрогнозыВероятности.Период КАК Дата,
	|	ПрогнозыВероятности.Вероятность КАК Вероятность
	|ИЗ
	|	РегистрСведений.CRM_ПрогнозыВероятностиСделки.СрезПоследних(, Сделка = &Сделка) КАК ПрогнозыВероятности");
	
	Запрос.Параметры.Вставить("Сделка", Сделка);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат ДанныеВероятности;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(ДанныеВероятности, Выборка);
	
	Возврат ДанныеВероятности;
	
КонецФункции

Процедура ЗаписатьВероятность(Сделка, Вероятность) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.CRM_ПрогнозыВероятностиСделки.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	МенеджерЗаписи.Сделка = Сделка;
	Менеджерзаписи.Вероятность = Вероятность;
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
